src/cf/InformationRegisters/ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаЗанятыхНаПодземныхИВредныхРаботах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаЗанятыхНаТяжелыхИПрочихРаботах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТарифыДополнительныхВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией();
	
КонецПроцедуры

Процедура ЗаполнитьТарифыДополнительныхВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией()

	НаборЗаписей = РегистрыСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СоздатьНаборЗаписей();	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20130101';
	Запись.ЗаЗанятыхНаПодземныхИВредныхРаботах = 4;
	Запись.ЗаЗанятыхНаТяжелыхИПрочихРаботах = 2;
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20140101';
	Запись.ЗаЗанятыхНаПодземныхИВредныхРаботах = 6;
	Запись.ЗаЗанятыхНаТяжелыхИПрочихРаботах = 4;
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20150101';
	Запись.ЗаЗанятыхНаПодземныхИВредныхРаботах = 9;
	Запись.ЗаЗанятыхНаТяжелыхИПрочихРаботах = 6;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
